Revit 2022 API
FabricationPartSizeMap Members
The FabricationPartSizeMap type exposes the following members.
Constructors
Name | Description
FabricationPartSizeMap(String, Double, Double, Boolean)
 Creates a new instance of the FabricationPartSizeMap class.
FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32)
 Creates a new instance of the FabricationPartSizeMap class.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationPartSizeMap
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AllowMultipleServiceSizes
 State flag to allow multiple services to include the same size.
Depth
 The depth of the straight.
GroupId |  Obsolete.
 This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `PaletteId` method instead.
IsMappedProductList
 Are the mapped sizes for a product listed fabrication part.
IsProductList
 Are the sizes for a product listed fabrication part.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MappedDepth
 The mapped size for the depth of the straight.
MappedProfileType
 The mapped shape of the straight.
MappedServiceId
 The mapped service identifier of the straight.
MappedWidthDiameter
 The mapped size for the width or diameter of the straight.
PaletteId
 The palette identifier of the straight.
ProfileType
 The shape of the straight.
ServiceId
 The service identifier of the straight.
SizeString
 The size display string for the straight that can be used by the user interface.
WidthDiameter
 The width or diameter of the straight.
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace